src/main/java/br/com/infotera/it/tboholiday/newXMLDocument.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header>
        <Credentials xmlns="http://TekTravel/HotelBookingApi" UserName="InfoteraTest" Password="Inf@64890970"/>
    </soap:Header>
    <soap:Body>
        <HotelRoomAvailabilityRequest xmlns="http://TekTravel/HotelBookingApi">
            <SessionId>4b441352-4835-4fd4-81e5-eea0bc211507</SessionId>
            <ResultIndex>1</ResultIndex>
            <AvailableForBook>true</AvailableForBook>
            <AvailableForConfirmBook>true</AvailableForConfirmBook>
            <CancellationPoliciesAvailable>true</CancellationPoliciesAvailable>
            <HotelCancellationPolicies>
                <HotelNorms>
                    <string>No breakfast service-This booking is non-amendable No breakfast service-This booking is non-amendable</string>
                </HotelNorms>
                <CancelPolicies PolicyFormat="Nodes">
                    <LastCancellationDeadline>2020-05-17T00:00:00</LastCancellationDeadline>
                    <CancelPolicy FromDate="2020-04-22" ToDate="2020-05-17" ChargeType="Fixed" CancellationCharge="0" Currency="USD"/>
                    <CancelPolicy FromDate="2020-05-18" ToDate="2020-05-24" ChargeType="Percentage" CancellationCharge="100" Currency="USD"/>
                    <DefaultPolicy>Early check out will attract full cancellation charge unless otherwise specified.</DefaultPolicy>
                    <AutoCancellationText>Hotel Destination Local Date and Time:17-May-2020 , 21:30:00</AutoCancellationText>
                </CancelPolicies>
            </HotelCancellationPolicies>
            <PriceVerification Status="Successful" PriceChanged="false" AvailableOnNewPrice="false"/>
            <AccountInfo AgencyBalance="Sufficient" AgencyBlocked="false"/>
            <HotelDetailsVerification Status="Successful" Remarks=""/>
            <HotelDetails HotelName="Ibis Fujairah" HotelRating="ThreeStar">
                <Address>Hamad Bin Abdullah Road, United Arab Emirates</Address>
            </HotelDetails>
            <IsFlightDetailsMandatory>false</IsFlightDetailsMandatory>
        </AvailabilityAndPricingResponse>
    </s:Body>
</s:Envelope>

